# 문제
# 어떤 자연수 N이 있을 때, 그 자연수 N의 분해합은 N과 N을 이루는 각 자리수의 합을 의미한다. 
# 어떤 자연수 M의 분해합이 N인 경우, M을 N의 생성자라 한다. 
# 예를 들어, 245의 분해합은 256(=245+2+4+5)이 된다. 따라서 245는 256의 생성자가 된다. 
# 물론, 어떤 자연수의 경우에는 생성자가 없을 수도 있다. 반대로, 생성자가 여러 개인 자연수도 있을 수 있다.
# 자연수 N이 주어졌을 때, N의 가장 작은 생성자를 구해내는 프로그램을 작성하시오.
# n = i + sum(si) 형태로 분해합 계산

# 입력
# 첫째 줄에 자연수 N(1 ≤ N ≤ 1,000,000)이 주어진다.

# 출력
# 첫째 줄에 답을 출력한다. 생성자가 없는 경우에는 0을 출력한다.

n = int(input())

for i in range(1, n+1):
    num_digits = list(map(int, str(i)))
    if n == i + sum(num_digits):
        print(i)
        break
    if i == n:
        print(0)

# 1부터 n까지 반복문 돌면서
# 각 숫자 i의 자리수 분리 후 리스트로 만들고
# 그 자리수의 합을 계산
# 만약 i와 n의 분해합이 같다면 i가 n의 생성자 => i를 return하고 반복문 종료
# 만약 반복문이 끝날 때까지 생성자를 못찾음 = i가 n과 같아짐 = 생성자 없음 => 0 return 
